In [57]:
import pandas as pd
import numpy as np

 # Pandas Serileri

In [28]:
seri=pd.Series([1,2,3,4,5]) # serinin değerleri ve index değerleri bir arada verilir
seri

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [29]:
type(seri)

pandas.core.series.Series

In [30]:
seri.axes

[RangeIndex(start=0, stop=5, step=1)]

In [31]:
seri.ndim

1

In [32]:
seri.values

array([1, 2, 3, 4, 5], dtype=int64)

In [33]:
seri.head(2) # elemanları baştan kaç tane 
seri.tail(3)

2    3
3    4
4    5
dtype: int64

In [34]:
pd.Series([14,45,55,78],index=[1,3,5,7])

1    14
3    45
5    55
7    78
dtype: int64

In [35]:
pd.Series([14,45,55,78],index=["a","b","c","d"])

a    14
b    45
c    55
d    78
dtype: int64

In [36]:
sozluk=pd.Series({"reg":10,"Del":15})

In [37]:
sozluk

reg    10
Del    15
dtype: int64

In [38]:
pd.concat([seri,seri])

0    1
1    2
2    3
3    4
4    5
0    1
1    2
2    3
3    4
4    5
dtype: int64

In [39]:
seri.index

RangeIndex(start=0, stop=5, step=1)

In [40]:
list(seri.items())

[(0, 1), (1, 2), (2, 3), (3, 4), (4, 5)]

In [41]:
seri**5

0       1
1      32
2     243
3    1024
4    3125
dtype: int64

``` Pandas DataFrame Olusturma ```

In [42]:
myList=[1,7,8,15,45,75,45]

In [43]:
pd.DataFrame(myList,columns=["Degisken_Ismı"])

   Degisken_Ismı
0              1
1              7
2              8
3             15
4             45
5             75
6             45

In [44]:
import numpy as np
m=np.arange(0,9).reshape(3,3)

In [45]:
df=pd.DataFrame(m,columns=["Var1","Var2","Var3"])

In [46]:
df.head()

   Var1  Var2  Var3
0     0     1     2
1     3     4     5
2     6     7     8

In [47]:
df.columns=("deg1","deg2","deg3")

In [48]:
df

   deg1  deg2  deg3
0     0     1     2
1     3     4     5
2     6     7     8

In [49]:
type(df)

pandas.core.frame.DataFrame

In [50]:
df.shape

(3, 3)

In [51]:
df.values

array([[0, 1, 2],
       [3, 4, 5],
       [6, 7, 8]])

In [55]:
df.loc[0]

deg1    0
deg2    1
deg3    2
Name: 0, dtype: int32

In [56]:
df["deg2"]

0    1
1    4
2    7
Name: deg2, dtype: int32

In [59]:
myArray=np.random.normal(5,11,size=(3,3))

In [66]:
dataArray=pd.DataFrame(myArray,index=["Dogukan","Serdar","Mehmet"],columns=["A Data","B Data","C Data"])

In [67]:
dataArray

            A Data     B Data     C Data
Dogukan   9.506321   3.594234   4.943940
Serdar   -7.025326  11.510643  21.756184
Mehmet  -11.095635   5.024518  24.823289

In [68]:
dataArray["D Data"]=dataArray["A Data"]+dataArray["C Data"]

In [69]:
dataArray

            A Data     B Data     C Data     D Data
Dogukan   9.506321   3.594234   4.943940  14.450261
Serdar   -7.025326  11.510643  21.756184  14.730859
Mehmet  -11.095635   5.024518  24.823289  13.727654

In [70]:
dataArray.loc["Dogukan"]

A Data     9.506321
B Data     3.594234
C Data     4.943940
D Data    14.450261
Name: Dogukan, dtype: float64

In [71]:
dataArray.loc["Dogukan"]["A Data"]

9.506320923874906

In [72]:
dataArray.loc["Dogukan","B Data"]

3.5942336889248967

In [74]:
dataArray[dataArray>0]

           A Data     B Data     C Data     D Data
Dogukan  9.506321   3.594234   4.943940  14.450261
Serdar        NaN  11.510643  21.756184  14.730859
Mehmet        NaN   5.024518  24.823289  13.727654